[
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "24375664",
        "review_id": "5cd416f3efc3f944fce4ce2db2290d5e",
        "rating": 5,
        "review_text": "Mind blowingly cool. Best science fiction I've read in some time. I just loved all the descriptions of the society of the future - how they lived in trees, the notion of owning property or even getting married was gone. How every surface was a screen. \n The undulations of how society responds to the Trisolaran threat seem surprising to me. Maybe its more the Chinese perspective, but I wouldn't have thought the ETO would exist in book 1, and I wouldn't have thought people would get so over-confident in our primitive fleet's chances given you have to think that with superior science they would have weapons - and defenses - that would just be as rifles to arrows once were. \n But the moment when Luo Ji won as a wallfacer was just too cool. I may have actually done a fist pump. Though by the way, if the Dark Forest theory is right - and I see no reason why it wouldn't be - we as a society should probably stop broadcasting so much signal out into the universe.",
        "date_added": "Fri Aug 25 13:55:02 -0700 2017",
        "date_updated": "Mon Oct 09 08:55:59 -0700 2017",
        "read_at": "Sat Oct 07 00:00:00 -0700 2017",
        "started_at": "Sat Aug 26 00:00:00 -0700 2017",
        "n_votes": 16,
        "n_comments": 0
    },
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "18245960",
        "review_id": "dfdbb7b0eb5a7e4c26d59a937e2e5feb",
        "rating": 5,
        "review_text": "This is a special book. It started slow for about the first third, then in the middle third it started to get interesting, then the last third blew my mind. This is what I love about good science fiction - it pushes your thinking about where things can go. \n It is a 2015 Hugo winner, and translated from its original Chinese, which made it interesting in just a different way from most things I've read. For instance the intermixing of Chinese revolutionary history - how they kept accusing people of being \"reactionaries\", etc. \n It is a book about science, and aliens. The science described in the book is impressive - its a book grounded in physics and pretty accurate as far as I could tell. Though when it got to folding protons into 8 dimensions I think he was just making stuff up - interesting to think about though. \n But what would happen if our SETI stations received a message - if we found someone was out there - and the person monitoring and answering the signal on our side was disillusioned? That part of the book was a bit dark - I would like to think human reaction to discovering alien civilization that is hostile would be more like Enders Game where we would band together. \n I did like how the book unveiled the Trisolaran culture through the game. It was a smart way to build empathy with them and also understand what they've gone through across so many centuries. And who know a 3 body problem was an unsolvable math problem? But I still don't get who made the game - maybe that will come in the next book. \n I loved this quote: \n \"In the long history of scientific progress, how many protons have been smashed apart in accelerators by physicists? How many neutrons and electrons? Probably no fewer than a hundred million. Every collision was probably the end of the civilizations and intelligences in a microcosmos. In fact, even in nature, the destruction of universes must be happening at every second--for example, through the decay of neutrons. Also, a high-energy cosmic ray entering the atmosphere may destroy thousands of such miniature universes....\"",
        "date_added": "Sun Jul 30 07:44:10 -0700 2017",
        "date_updated": "Wed Aug 30 00:00:26 -0700 2017",
        "read_at": "Sat Aug 26 12:05:52 -0700 2017",
        "started_at": "Tue Aug 15 13:23:18 -0700 2017",
        "n_votes": 28,
        "n_comments": 1
    },
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "18914012",
        "review_id": "d27bccd12a000a9831105c73c3240d24",
        "rating": 4,
        "review_text": "Super fun book - the story of a sysadmin chasing a hacker during the early internet, but it reads almost like a thriller - fun and fast. \n I think I learned more about the early internet from this book than anything I've ever read before. I had heard of the words Arpanet and Milnet, but really didn't know what they were - simple networks of computers. And apparently, with very poor security! Impressive how easy it was for the hacker to get root access back then. \n Internet security has come a long ways since those days (and has a very long way to go) - but you can really get a sense of how it started and where it's going by reading this.",
        "date_added": "Fri Apr 01 14:43:51 -0700 2011",
        "date_updated": "Fri Dec 09 12:03:40 -0800 2016",
        "read_at": "Fri Jan 01 00:00:00 -0800 2016",
        "started_at": "Sun Dec 27 00:00:00 -0800 2015",
        "n_votes": 14,
        "n_comments": 2
    },
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "478",
        "review_id": "1ec765c1f244d68cde906b3fa2334151",
        "rating": 0,
        "review_text": "Recommended by steve blank",
        "date_added": "Thu Mar 31 12:46:42 -0700 2011",
        "date_updated": "Thu Mar 31 12:46:57 -0700 2011",
        "read_at": "",
        "started_at": "",
        "n_votes": 1,
        "n_comments": 0
    },
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "10139649",
        "review_id": "76357fd41b3954971b43590fdcb6fdba",
        "rating": 4,
        "review_text": "Great story about the founding of Microsoft from it's cofounder Paul Allen. I've read a few books about Microsofts history before (such as Gates), but it was fascinating to hear it from the horses mouth. \n What stuck out for me was that Paul and Bill were on the cutting edge of software ever since they first saw a computer as teenagers. Malcolm Gladwell in Outliers mentioned the fact that having access to a computer at that time was a huge advantage, and Paul's story confirms that. The world only changes massively so many times, and the age of computing has certainly been one of them - and Paul and Bill were in the right place, at the right time, and with the right drive to succeed. \n What was impressive was how Paul and Bill executed like crazy. They had the edge, and they worked really hard, long hours to keep it. It was sad that Paul burned out so early - but also understandable given that Bill had such a strong personality. \n Paul prides himself on being a forward thinker. He gives multiple stories of always following the latest technology and trying to look forward and think about what is coming next. Indeed, it's that trait that led to Microsoft being formed as they were certainly at the forefront of the software revolution. In one part of the book Paul even predicts that Mobile is the next big platform and that the PC is dying. \n I've always worked at startups, which tend to innovate more than they follow. So it was interesting to hear Allen talking about how Microsoft's strategy went from being on the cutting edge of technology in it's infancy to being a 400 pound gorilla that used a approach of copying innovative products and using it's cash reserves and muscle to out-execute on an idea. I suppose this is what a big company has to do - but it's a hard position to win from. An Microsoft really hasn't had a lot of wins lately. They haven't innovated enough on Hotmail. Bing is nice but not better than Google in any significant ways. And even the high and mighty Internet Explorer is really losing ground to Chrome/Firefox/Safari. Paul is right - you have to look to what is ahead. \n Since Microsoft, Paul has certainly stayed busy: owning sports teams, investing in lots of different companies, building a space program, and touring around on his 400 foot yacht. Most of his investments have been in the vein of improving technology and trying to predict the next big things, especially in his particular interests. \n I think his brain mapping project and the Digital Aristotle projects stand out - they sound really interesting and important. The appendix lists a few of the current challenges issues with getting a computer to understand human language, which was fascinating. Allen even alludes to the oft-mentioned Singularity, but says that he doesn't think it will occur in our lifetimes, as despite Moore's law advancing computing power fast enough, we are lightyears away with AI. \n Some useful tidbits: \n - p65 Even Bill Gates wasn't the best at Math in college at Harvard. There are all kinds of smarts! \n - Lesson: decentralize or don't distract the ceo: http://www.goodreads.com/quotes/show/... \n - It was interesting that Allen said that his biggest mistakes were not finding the right people to help him execute his visions. It's all about people. \n Update: my interview with Paul Allen is now live!",
        "date_added": "Tue Mar 22 00:44:51 -0700 2011",
        "date_updated": "Mon May 02 18:13:27 -0700 2011",
        "read_at": "Wed Apr 13 00:00:00 -0700 2011",
        "started_at": "Wed Apr 06 00:00:00 -0700 2011",
        "n_votes": 12,
        "n_comments": 0
    },
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "8519525",
        "review_id": "2f9197113af54bf20b83db1046c3a4ea",
        "rating": 5,
        "review_text": "** spoiler alert ** \n A very well written series of short stories. There was no \"main\" character, though I was curious and counted and out of 13 chapters, Sasha was in 5 and and Bennie Salazar was in 4. The story wove and dipped in and out of their lives, and occasionally into surrounding characters. I thought it was a little hard to keep track of all the stories and how they related, though. \n I think Lou was one of my favorite characters. Lou is a stereotypical record producer and ladies man. I loved how he at one point was quoted as saying \"I'll never get old\", and then there was a whole chapter later dedicated to his death. Lou is one of those guys that is immediately likable, even though you know he's probably not a great role model: \"The world is full of shitheads, Rhea. Don't listen to them--listen to me. And I know that Lou is one of those shitheads. But I listen.\" \n If this book has a theme I think it's something to do with how people change as they get older. \"Time is a goon\" was quoted in two different chapters, and if it means \"goon\" as in a thug, then the implication is that time \"beats us up' - or changes us - as our lives go on. We remain the same people underneath, but we are defined by the experiences we have, and the more time we live the more life shapes us into totally different people. \n In the last chapter I loved the concept of the parrots - or people who sell out and endorse a product to create \"authentic\" word of mouth. As someone who is building a social network I think this is an interesting perspective, and one that I think is definitely a trend. It's nothing even new - celebrities have been selling out and taking money to endorse products for a long time. \n But what is new is that celebrities aren't the only ones with followings anymore. Now with Facebook and Twitter and other social networks (yes, even Goodreads), regular people can amass hundreds and even thousands of friends. And maybe instead of paying one celebrity with 100K followers to promote something you pay 100 people with 1K followers. Indeed this is already starting - some friends of mine helped start Ad.ly - which lets you buy celebrities tweets.",
        "date_added": "Wed Feb 16 17:13:02 -0800 2011",
        "date_updated": "Sat May 07 19:45:28 -0700 2011",
        "read_at": "Fri May 06 00:00:00 -0700 2011",
        "started_at": "Fri Mar 11 00:00:00 -0800 2011",
        "n_votes": 4,
        "n_comments": 0
    },
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "38840",
        "review_id": "06ca1b298256e29833fbc8cfaaf02e38",
        "rating": 4,
        "review_text": "A very interesting book about John Boyd, who was a crack fighter pilot, and then later military strategist and reformer. Boyd flew as an instructor in the real life version of Top Gun, and beat everyone in 40 seconds or less. But later in his life he really studied military strategy, and this is where the interesting parts of this book are. \n Boyd was literally the designer of the F-15, and a theory of maneuvering called Energy-Manueverability (E-M), which mathematically gave a chart for each aircraft that gave pilots an idea of the ideal speeds and altitudes they could use to pull off various turns and tactics. \n One interesting thing I noted was that throughout his career, like everyone else in the military, Boyd was getting reviewed by his superiors, called ER's. It was interesting to hear, and relevant to business, how you had to \"read through the lines\" and how even a positive sounding ER could be a career-killer if the person wasn't recommended for promotion. Reading this has definitely made me think twice every time I've read (or written) recommendations for people. \n Another Boyd tidbit I liked was when fighting bureaucratic battles in the Pentagon, he had a mantra to \"use the other persons information against him\". Starting with the other persons argument and data, and working backwards, you can make pretty compelling arguments. \n Perhaps the biggest idea Boyd came up with is what is called the OODA loop, which stands for Observe, Orient, Decide, Act. A key quote defining the OODA loop: \n \"Thinking about operating at a quicker tempo - not just moving faster - than the adversary was a new concept in waging war. Generating a rapidly changing environment - that is, engaging in activity that is quick it is disorienting and appears uncertain or ambiguous to the enemy - inhibits the adversary's ability to adapt and causes confusion and disorder that, in turn, causes an adversary to overreact or underreact. Boyd closed the briefing by saying the message is that whoever can handle the quickest rate of change is the one who survives.\" \n Another great quote that helps explain it: \n \"Boyd said the strategies and bloodbaths of World War 1 were the natural consequence of both the vo Clausewitzian battle philosophy and the inability of generals to adapt new tactics to nineteenth-century technology: line abreast, mass against mass, and linear defenses against machine guns and quick-firing artillery. The bankrupt nature of that doctrine was demonstrated on the first day of the Battle of the Somme, which the British suffered sixty thousand casualties. After more than three years of the meat-grinding form of war, the Germans began engagements with a brief artillery barrage with smoke and gas obscuring their intentions, then sent in a special infantry teams. These small groups looked for gaps in the defense and advanced along many paths. They did not hit strong points but instead went around them, pressing on, always going forward and not worrying about their flanks. They were like water going downhill, bypassing obstacles, always moving, proving, and then, when they found an opening, pouring through, pressing deeper and deeper.\" \n Getting your lieutenants to the point where they can do this kind of infiltration successfully requires great communication and men who can think fast on their feet. In other words, you had to enable every leader to be able to follow the OODA loop, and just arm them with the overal goals, and trust them to make their own decisions. Very different from previous military structures, where \"the need to know\" remained at the top. \n Why is this empowerment valuable? Because: \n \"The key thing to understand about Boyd's version is the not the mechanical cycle itself, but rather the need to execute the cycle in such fashion as to get inside the mind and the decision cycle of the adversary. This means the adversary is dealing with out-dated or irrelevant information and thus becomes confused and disoriented and can't function.\" \n And: \n \"Understanding the OODA loop enables a commander to compress time - that is, the time between observing a situation and taking an action. A commander can use the temporal discrepancy (a form of fast transient) to select the least-expected action rather than what is predicted to be the most effective action. The enemy can also figure out what might be the most effective. To take the least-expected action disorients the enemy. It causes him to pause, wonder, to question.\" \n This makes sense. You can almost picture the commanders of old, who used to have to get on the phone with their boss in order make any decision. \"Take the bridge, blow it up, or wait?\". Hours and days could be spent waiting around for generals to make up their minds. This form of maneuver warfare is what the Germans used in WWII - they called it blitzkrieg - and it's what we used in Iraq the first time. \n In business we have a word for the above - micromanagement. In a sense, it sounds like empowering business leaders and their lieutenants to have an effective OODA loop is what will let a business move faster and win marketshare. I bet somebody has written a book about that - I will have to look.",
        "date_added": "Tue Dec 21 08:34:04 -0800 2010",
        "date_updated": "Mon Mar 28 00:32:53 -0700 2011",
        "read_at": "Sat Mar 26 00:00:00 -0700 2011",
        "started_at": "Tue Dec 21 00:00:00 -0800 2010",
        "n_votes": 5,
        "n_comments": 4
    },
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "43536",
        "review_id": "bea63c9e3bef94bc581e94ce6a07a3ee",
        "rating": 4,
        "review_text": "List of great observations and leadership tidbits. Doesn't give full stories examples behind each, so I found it a little hard to apply or let the lesson synch in. I switched to his auto-biography, They Call Me Coach (see my review) to get those.",
        "date_added": "Mon Dec 13 15:12:26 -0800 2010",
        "date_updated": "Wed Dec 14 12:30:43 -0800 2016",
        "read_at": "Mon Sep 21 00:00:00 -0700 2015",
        "started_at": "Thu Mar 19 00:00:00 -0700 2015",
        "n_votes": 6,
        "n_comments": 1
    },
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "145102",
        "review_id": "6ca38491139e7c5b4a3c75e52e266c2d",
        "rating": 0,
        "review_text": "Regimented by Brian and kyusik",
        "date_added": "Mon Nov 29 19:17:41 -0800 2010",
        "date_updated": "Mon Nov 29 19:18:11 -0800 2010",
        "read_at": "",
        "started_at": "",
        "n_votes": 0,
        "n_comments": 0
    },
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "6496815",
        "review_id": "9f1ddbe0f4d8e8f70cbdf2b0fbdf1560",
        "rating": 0,
        "review_text": "Eric recommends",
        "date_added": "Fri Nov 26 21:06:27 -0800 2010",
        "date_updated": "Wed Mar 22 11:46:50 -0700 2017",
        "read_at": "",
        "started_at": "",
        "n_votes": 0,
        "n_comments": 0
    },
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "1707053",
        "review_id": "01a8f268ac68a12e4feb4713d11925a0",
        "rating": 0,
        "review_text": "If I ever go to Peru, this is top of the list.",
        "date_added": "Thu Nov 11 14:02:27 -0800 2010",
        "date_updated": "Thu Nov 11 14:02:56 -0800 2010",
        "read_at": "",
        "started_at": "",
        "n_votes": 1,
        "n_comments": 0
    },
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "6452796",
        "review_id": "33f25b63a8a5be9b832f706c4c0a1cfc",
        "rating": 3,
        "review_text": "Kareem recommends",
        "date_added": "Fri Oct 08 08:02:15 -0700 2010",
        "date_updated": "Wed Mar 22 11:46:49 -0700 2017",
        "read_at": "",
        "started_at": "",
        "n_votes": 1,
        "n_comments": 0
    },
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "211099",
        "review_id": "b662fcdf0791b3bbccca2d5f1f7b5ba1",
        "rating": 5,
        "review_text": "I learned two major things from this book: the power of branding, and the fact that Richard Branson has balls of solid steel. \n Branson is one of the great entrepreneurs of our era, and it was truly inspiring to hear his story in his own words. A kid who skipped college and dove straight into business, and time and time again proved he can succeed with a lot of will, determination, and his maverick ability to take big bets and win. Bransons' success is nothing short of inspirational. \n I had no idea until reading this how powerful the Virgin brand is, or how many businesses they have gone into. They effectively function like a VC, except they also lend their brand (and perhaps some infrastructure too). Each business is a subsidiary, given its leaders the freedom to move fast and achieve their goals without being slown down by needing permission from the mother ship. This is brilliant. Many of the businesses also complement each other in profitable ways - such as how Virgin Travel and Virgin Atlantic complemented each other. \n Branson is a risk-taker. When Virgin Records was about to run out of cash, instead of scraping what he had left to limp on, he scraped it together to make a big bet. It's kind of like going all-in in poker when your chips are getting low - better than losing slowly! \n \"I have always believed that the only way to cope with a cash crisis is not to contract but to try to expand out of it.\" \n But the difference with Branson is that he didn't take the risks blindly. When he started the airlines he spent considerable effort leasing the airline for 1 year and limiting his downside. \n It is only by being bold that you get anywhere. If you are a risk-taker, then the art is to protect the downside.\" \n One thing I loved about Branson, is he was not afraid to bluff. This was first illustrated early in the book when, learning about a plot to force him out of Student, he acted pre-emptively and told the leader that he had already switched the teams mind - when instead he had no idea how far along the plot actually was. We see this time and time again - Branson is able to divine where things are going, and negotiate on points he isn't even wholly sure about. \n Branson detailed a lot of his crazy ballooning adventures, which I wasn't so into. I wanted to hear how he built Virgin. Although I did appreciate that his passion for ballooning did lead to several advances in airplane technology. \n The end of the book went into a lot of detail of how Branson is giving back to the world - which I respect a lot - any billionaire worth their salt should do that, but it was great to see him embrace the challenges with the same zeal he embrace business. From climate change to Virgin Fuel to Virgin Galactic, Branson is thinking hard about our planet and where its going and how to get us there. And of course, if Virgin Fuel does well it will only help his airline business - so not a bad bet.",
        "date_added": "Mon Oct 04 20:23:11 -0700 2010",
        "date_updated": "Wed Mar 22 11:46:49 -0700 2017",
        "read_at": "Sun Jul 22 00:00:00 -0700 2012",
        "started_at": "Sun Jul 01 00:00:00 -0700 2012",
        "n_votes": 39,
        "n_comments": 1
    },
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "612532",
        "review_id": "3dea47acbe98261b736694e0bcc95b1c",
        "rating": 0,
        "review_text": "Just heard a talk by Chip which was very inspirational. He talked a lot about Abraham H. Maslow's hierarchy, and how it can be applied to employees, customers, and investors. Employee pyramid is: salary => recognition => calling. I thought his principles were similar to Tony Hsieh's book Delivering Happiness: A Path to Profits, Passion, and Purpose. He even mentioned this was true, and that Tony and 10 other companies that had great culture had all studied Maslow (Apple, Southwest, Google, Whole Foods, Zappos, etc). \n The top of any pyramid is hard for most business leaders because it's the self-actualization - the intangible stuff, which can't be measured. And most business leaders are taught to run things by the numbers. Told a story to illustrate this about why Southwest doesn't charge fees for checking baggage. It's because they didn't want to make their flight attendants into baggage handlers - which is what happens on other airlines, where everyone tries to carry everything on to save money. Southwest flight attendants are happier than other airlines, and this leads to less employee turnover and higher customer retention. Which saves them money in the long run - it's just impossible to measure. He also noted that the hospital industry did an extensive survey of what the top hospitals in the nation had in common. The results: the nurses were happier and more involved in each one. \n Looking forward to the actual book, of which I now have a copy!",
        "date_added": "Thu Sep 23 09:27:55 -0700 2010",
        "date_updated": "Fri Sep 24 00:12:33 -0700 2010",
        "read_at": "",
        "started_at": "",
        "n_votes": 2,
        "n_comments": 4
    },
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "8694005",
        "review_id": "0e317947e1fd341f573192111bb2921d",
        "rating": 3,
        "review_text": "The Name of the Rose is a thrilling Dan Brown-esque murder mystery set in a 14th century Italian monastery. It really is two stories - the story of the murder mystery, and that of political climate in Italy at the time. And of course, they nicely interweave throughout. \n The history the book brought was one of my favorite parts. I learned about how the church controlled so much of the world, how even then it was already starting to fall from power, why saints are so prevalent in Italy, and more. I learned about Franciscans and Dolcians and minorites, and poverity and false monks. Poverty was a big theme, which came through on several levels: rebellions by poor people and religious leaders stepping in to lead the masses, and also an a debate about the role the Church should have in society. \n I loved brother William of baskerville. He was Sherlock Holmes-esque (so that can't be a coincidence he's from Baskerville right?) in his deductive reasoning and approach. I think my favorite moment of his was when he had no time left to solve the crime he said \"when a man has little time, he must take care to maintain his calm. We must act as if we had eternity before us.\" \n I took one star off because I often found myself skipping large sections that went into flowery details of something (often history) that just seemed irrelevant. \n The book was also a lot about change. The monks were so set in their ways and in their dogma that you could see how it likely took generations before a viewpoint could really change. The focus on humor for instance and the dogmatic viewpoint of Jorge was in my opinion simply nothing more than fear of change. We all know that the introduction of humor and the divine comedy didn't ruin the world. \n The library was one of the greatest in the world at the time. I would love to have seen it. Yet it was almost impossible to access, and that very lack of accessibility is what ultimately led to it's destruction. Seems like the message is that knowledge should be open and free and and keeping it locked up can be more dangerous than not.",
        "date_added": "Wed Sep 08 01:22:27 -0700 2010",
        "date_updated": "Wed Dec 14 12:30:43 -0800 2016",
        "read_at": "Mon Aug 10 00:00:00 -0700 2015",
        "started_at": "Mon Jul 20 00:00:00 -0700 2015",
        "n_votes": 17,
        "n_comments": 6
    },
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "8213519",
        "review_id": "1044128b0d6dea81a41b4107378931b2",
        "rating": 5,
        "review_text": "An extremely well-written account of the 2008 financial collapse. It explained complex ideas like subprime mortgage bonds and CDO's in a clear way, and almost read like a fast paced thriller. \n Essentially it seems that a bad ratings system and human greed created an economy that fostered the creation of a lot of bad debts, that eventually went bad, and caused a lot of big companies to go under (Lehman brothers, Bear Sterns), or require a bailout (Goldman Sachs, AIG). This is the real crime. These big companies were so focused on short term profits that they failed to see that long term what they were doing wasn't going to work. They should be appropriately punished for this, and instead many of them were saved by Uncle Sam. Would we have had a worse recession if Obama hadn't done that? Maybe. Maybe not. Lewis should write another book about that :) \n Let me see if I can get this right. The book explains that mortgages are sold by the banks that issue them, passing off the risk. Mortgages are aggregated into groups in mortgage bonds, which are then packaged into tranches, which are rated by agencies such as Moody's and S&P's. The math was complex, but apparently somehow tranches that consisted almost entirely of \"subprime\" (aka risky) mortgages were being given high A ratings. I guess the theory was that by spreading out the risk across lots of mortgage bonds it lowered the risk. Too bad this didn't work. \n Many of these mortgages were the variety that started 2 year fixed then went floating. They were largely taken out in 2005 - 2006, and as they hit 2 years the interest rates jumped as they went floating, and hoards of people defaulted. This explains why we teetered in 2007 and crashed in 2008. One of my favorite quotes to illustrate the madness: \n \"In Bakersfield, California, a Mexican strawberry picker with an income of $14,000 and no English was lent every penny he needed to buy a house for $724,000.\" \n And it wasn't just in Bakersfield. All over the country people were taking out loans that were too big for their britches, because the banks were encouraging it: \n \"The simple measure of sanity in housing prices, Zelman argued, was the ratio of median home price to income. Historically, in the United States, it ran around 3:1; by late 2004, it had risen nationally, to 4:1. \"All these people were saying it was nearly as high in some other countries,\" says Zelman. \"But the problem wasn't just that it was four to one. In Los Angeles it was ten to one and in Miami, eight-point-five to one.\" \n Economics is about incentives, and this book explained how they went very awry. But it was also a story about greed, and how even unintelligent people made a lot of money by riding the subprime mortgage train. The book followed several investors who noticed what was happening, but when they tried to tell people and test their \"crazy\" hypothesis that the financial world was going to collapse, they were mocked or ignored. So they just ended up shorting (betting against) the whole thing to make some money, which is what a good investor does. \n \"What are the odds that people will make smart decisions about money if they don't need to make smart decisions--if they can get rich making dumb decisions?\" \n I think the lesson in the end is that if it looks to good to be true, it is. That, and we need smarter people working at the ratings agencies.",
        "date_added": "Thu Jul 08 07:33:27 -0700 2010",
        "date_updated": "Wed Mar 22 11:46:45 -0700 2017",
        "read_at": "Thu Oct 14 00:00:00 -0700 2010",
        "started_at": "Mon Sep 06 00:00:00 -0700 2010",
        "n_votes": 16,
        "n_comments": 7
    },
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "7112495",
        "review_id": "0258b3c9a85cecb95f240e43a7642f60",
        "rating": 4,
        "review_text": "** spoiler alert ** \n An interesting book in terms of it's structure: 5 distinct stories that cascade into each other in subtle ways, then wind back out. This way of doing the structure was unique, and certainly very cool to see the subtle way they were tied together. But in the end it was kind of gimmick and probably not necessary. \n I generally don't try to summarize novels in my reviews, but in this case there was so much going on that the exercise was helpful. \n Story 1: The Pacific Journal of Adam Ewing. Later revealed to be a journal in other stories. A story about a rather weak-willed protagonist, who is constantly taken advantage of by others (the ships captain, Dr Goose). Interesting side story about the peaceful native Moriori tribe and how they were taken advantage of. \n Story 2: Robert Frobisher. Perhaps my favorite story - about a penniless young musician who as a last-ditch attempt apprentices himself to an old master musician, Vyvyan Ayrs. The story is told through letters to a friend, Sixsmith, who appears in the next story. The story is about how Frobisher, the apprentice, goes from being overjoyed to have a job to being resentful that the master is using him and stealing his stuff. Robert sleeps with VA's wife the whole story, but ends up falling in love with the daughter in a cruel twist of fate. \n Story 3: Luisa Rey. Modern age story about a young journalist hot on the heels of a big scandal involving an energy company. Sixsmith is an engineer who leaks the story to her, and also has the letters from story #2. Classic detective-esque story, with lots of people willing to kill to protect their secrets and power. \n Story 4: Timothy Cavendish. Modern age story about a book editor who gets a smash hit, then the author's mafia-esque family get's on his case and he's on the run. He lands in a old-persons home/prison. This story is kind of a nightmare, and is revealed to be a movie in the next story. \n Story 5: Somni 451. One of favorites, for how different it was. Set in the far future in an asian country, humans have genetically created clones that serve as slaves. This lower class is regarded as unintelligent and controlled with drugs - but our protagonist, Somni, breaks through and becomes self-conscious. The scary thing is I can easily see this happening! Told as recollections in an interview. \n Story 6: Sloosha's Crossin'. Story of Zach'ry and Meronym in post apocalyptic Hawaii. Somni is now their deity. Story of the Valleysmen people and their struggle for freedom against neighboring tribes. \n All six stories were very graphic and real, and had extremely good character development. Mitchel could with a single sentence describe someone that you understood in a way I can't describe here. \n I wish the stories had more themes in common so I could say what I learned from this book. Though I suppose if I had to put my finger on it, the major theme was freedom and slavery. Ewing was under the control of Dr Goose and the ship captain, Frobisher became an unwilling servant to Arys, Luisa Rey needed to find the truth in order to free herself from the corporate villians, Frobisher was a prisoner bent on escape in a nursing home, Somni was literally a slave in her society and focused on freedom, and Zach'ry's people were captured and enslaved. All the stories touched on various ways people can \"enslave\" and control other people for various reasons. \n I suppose the point is human beings are all greedy and will try to control other human beings, but if we are strong we can survive and find a way to free ourselves. Sounds good anyways, so I'll stick with that - but am interested to hear what other people thought.",
        "date_added": "Thu Jun 10 14:41:13 -0700 2010",
        "date_updated": "Tue Aug 07 12:11:05 -0700 2012",
        "read_at": "Sat Aug 07 00:00:00 -0700 2010",
        "started_at": "Mon Jul 05 00:00:00 -0700 2010",
        "n_votes": 7,
        "n_comments": 3
    },
    {
        "user_id": "8842281e1d1347389f2ab93d60773d4d",
        "book_id": "7518289",
        "review_id": "265c3e164075223139bb33ed37f19937",
        "rating": 5,
        "review_text": "This is a book that every entrepreneur definitely needs to read, and everyone who works even remotely with Facebook needs to read. It does a simply amazing job going behind the scenes of Facebook and describing where the site came from, how it got to where it is, and where it's going. \n The author had amazing inside access to Mark Zuckerberg and other key Facebook employees and investors. Very smart of Facebook to include David so often - it makes their story fully open, which is consistent with the values of their company - not to mention good PR. \n The biggest takeaway I had was that Zuckerberg actually has much more of a vision and philosophy than I gave him credit for. The basic vision for Facebook is that it's a communication tool. It's very interesting to see that they think of it as a utility tool and not a media destination (like MySpace no doubt does). It means they are not afraid of sending traffic away from their site as long as they provide value up front - something that has been crucial to their success. \n Zuckerbergs philosophy however is more interesting - he believes being open is better and will lead to a better society. He thinks the internet will inevitably enable this anyways, so Facebook might as well lead the charge. It's an interesting and idealistic philosophy - basically that it's really hard for a person to be dishonest or immoral in any way if their whole life is laid open to their friends. In fact, one has to strive to be an even better person, because everything we do is not being tracked and if it isn't already online, it will be soon. The books we read, the things we buy, the people we date, the places we go, the people we associate with - all this is online, and defines who we are. Would my future children be proud of me if they examined my life's consumption? If I knew they were going to do so, would I make better choices? Absolutely. \n However the privacy road has rocked many people's worlds who haven't gotten the hint yet and EVERYTHING you put online, whether on Facebook or a seeming private place elsewhere, is ultimately public. The chapter on privacy listed many of these horror stories, and I certainly know more than a few stories of people who have been burned by having an inappropriate photo on Facebook or tweeting something inappropriate. The road to openness is happening - and I think Mark is right that it's going to make us better as a society. The danger, however, is that it will still cause many people a lot of pain as we get there - and may cause many to ultimately retreat from Social Networking (and the internet). I think Mark knows his responsibility there as his service depends on it, and I hope he's a good steward, as this is certainly a topic we debate a lot at Goodreads. \n I worked in Social Networking during the Rise of Facebook - my company, Tickle, is even mentioned a few times in the book. This book made the mistakes we made at Tickle even more apparent. Hindsight is a ...! For instance, starting with colleges that were *private* was what really worked - everyone had no problems sharing everything with their fellow classmates and alums. \n Facebook's biggest product innovation though was of course Platform. Followed perhaps by the Like button and Facebook Connect - which are really only possible because so many people use Facebook. Both were big wins, and were interesting pushed hard by Zuckerberg, and their success really validated him as a leader internally. \n One interesting note that I hadn't considered was that because everyone uses their real names on Facebook, blogs that use Facebook Connect for comments (eg Huffington Post) don't have the troll problem as much, because of the openness issue (see above). \n The book was also very interesting as it gave a lot of the details of how Facebook was financed, how the VC deals were structured, what sort of offers it got, etc. Zuckerberg was courted to sell by so many large companies, I had always wondered how he had the nerve to say no - most in his shoes would have sold out for millions or billions long ago. The answer seems to be that he doesn't really value money, and also that he knows this is his big Life's Opportunity to change the world - and to sell now would be to squander it. \n The book also gave interesting insight into where Facebook thinks they are going. In the future they think they will be less of a destination site, and more of a social communication enabler. Everything that can be social will be, and it will be done with Facebook. Every website you visit, your TV, video games, and perhaps even your cereal box will one day have Facebook Connect.",
        "date_added": "Fri May 14 13:11:51 -0700 2010",
        "date_updated": "Thu Sep 22 14:31:47 -0700 2011",
        "read_at": "Sun Dec 12 00:00:00 -0800 2010",
        "started_at": "Sat Nov 27 00:00:00 -0800 2010",
        "n_votes": 33,
        "n_comments": 11
    }
]